app/Controllers/PSiswaController.php

    public function index()
    {
        return view('backend/pegawai/siswa',[
            'kelas' => (new KelasModel())->findAll()
            ]);
---
SELECT *
FROM `kelas`